xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
#include "task_apollo2.h"
#include "drv_apollo2.h"
#include "dev_apollo2.h"
#include "cmd_apollo2.h"
#include "app_srv_apollo.h"

#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "portmacro.h"
#include "portable.h"
#include "event_groups.h"
#include "semphr.h"

#include "nrf_drv_gpiote.h"
#include "nrf_sdm.h"
#include "cmd_gpregret.h"
#include "nrf_pwr_mgmt.h"

#include "nrf_delay.h"
#include "cmd_pc.h"
#include "task_extFlash.h"
#include "task_ble_conn.h"
#include "nrf_power.h"
#include "app_srv_wechat.h"
#include "task_ble_accessary.h"
#include "cmd_nrf52_srv.h"
#include "cmd_apollo_srv.h"
#include "app_srv_nrf52.h"
#include "app_srv_ancs.h"

#include "drv_ble_flash.h"

#include "drv_wdt.h"
#include "watch_config.h"

#if defined (COD)
#include "cod_ble_api.h"
#include "app_srv_cod.h"

#endif

#define LOG_LEVEL_OFF 							0
#define LOG_LEVEL_ERROR 						1
#define LOG_LEVEL_WARNING 						2
#define LOG_LEVEL_INFO 							3
#define LOG_LEVEL_DEBUG 						4
#define NRF_LOG_MODULE_NAME 					task_apollo2
#define NRF_LOG_LEVEL       					LOG_LEVEL_INFO
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"
NRF_LOG_MODULE_REGISTER();

#ifdef LAYER_BOOTLOADER  
#define DELAY_MS(X)                 nrf_delay_ms(X)
#endif

#ifdef LAYER_APPLICATION 
//#define DELAY_MS(X)                 nrf_delay_ms(X)
#define DELAY_MS(X)                 vTaskDelay(X)
//#define DELAY_MS(X)                   do{TickType_t xLastWakeTime;xLastWakeTime = xTaskGetTickCount ();vTaskDelayUntil( &xLastWakeTime, X / ( ( TickType_t ) 1000 / 3 ) );}while(0)
#endif






static bool m_ble_jump_bootloader = false;

static TaskHandle_t task_handle;



#define TASK_APOLLO_USE_QUEUE

#ifdef TASK_APOLLO_USE_QUEUE
static QueueHandle_t QueueTask = NULL;
struct s_queue_task{
	uint8_t	evt;
	uint32_t *p_data;
	uint32_t length;
	
};
typedef struct s_queue_task _queue_task;

static _queue_task queue = {0,NULL,0};

#else
typedef struct{
	uint8_t	evt;
	uint32_t *p_data;
	uint32_t length;
} _task_buffer;
static _task_buffer m_task_buffer = {0,NULL,0};

#endif


typedef struct __attribute__((packed))
{
	uint32_t command;
	uint32_t step;
	uint32_t calory;
	uint32_t distance;
}_wechat_sport_data;


extern bool g_is_central_mode;


static void	ble_uart_ccommand_application_ble_info(void);
static void ble_uart_response_application_info_apollo2(void);
#ifdef COD

_all_day_steps all_day_steps[7];
uint8_t all_day_sync_data[10];
static void ble_uart_response_application_info_bat(void);
static void ble_uart_response_application_current_time_read(void);
static void ble_uart_response_application_location_info(void);
static void ble_uart_response_application_phone_call_status(void);
static void ble_uart_response_application_phone_call_delay(void);
static void ble_uart_response_application_phone_call_ctrl(void);
static void ble_uart_response_application_on_bind_device(void);
static void ble_uart_response_application_send_bind_status(void);
static void ble_uart_response_application_cmd_cast(void);
static void ble_uart_response_application_rt_today(void);
static void ble_uart_response_application_rt_heart(void);
static void ble_uart_response_application_sport_ctrl(void);
static void ble_uart_response_application_sensor_data_trains(void);
static void ble_uart_response_application_rest_heartrate(void);
static void ble_uart_response_application_data_frame_num(void);
static void ble_uart_response_application_deletle_data(void);
static void ble_uart_response_application_mac_read(void);
static void ble_uart_response_application_mac_write(void);
static void ble_uart_response_application_updata_bp_start(void);
static void ble_uart_response_application_real_time_log_trains(void);
#endif
#ifdef WATCH_QIWEI_SPORT_DATA
static void ble_uart_response_application_sport_data_upload(void);
#endif

static void ble_uart_ccommand_applciation_jump_bootloader(void);
static void pc_uart_response_application_jump_bootloader(void);
static void pc_uart_command_hardware_test_ble_info_read(void)	;
static void pc_uart_command_hardware_test_ble_rssi_read(void);
static void pc_uart_command_hardware_test_ble_rssi_read_stop(void);
static void pc_uart_command_hardware_test_ble_extflash_read(void);
static void ble_uart_response_application_weather_info_request(void);
static void ble_uart_response_application_current_time_write(void);
static void ble_uart_response_application_personal_info_read(void);
static void ble_uart_response_application_personal_info_write(void);
static void ble_uart_response_application_sports_param_read(void);
static void ble_uart_response_application_sports_param_write(void);
static void ble_uart_response_application_app_message_android(void);
static void ble_uart_response_application_wechat_sport_data_request(void);
static void ble_uart_cdommand_application_scan_enable(void);	
static void ble_uart_cdommand_application_scan_disable(void);		
static void ble_uart_response_application_extflash_config_astro_sync_request(void);
static void ble_uart_response_application_extflash_config_main_day_data_request(void);
static void ble_uart_response_application_extflash_config_activity_address_request(void);
static void ble_uart_response_application_extflash_config_activity_address_boundary_request(void);
static void ble_uart_response_application_extflash_config_shard_track_address_request(void);
static void ble_uart_response_application_extflash_config_shard_track_header_write(void);
static void ble_uart_command_application_find_phone(void);
static void ble_uart_response_application_extflash_config_train_plan_request_uuid(void);
static void ble_uart_response_application_extflash_config_train_plan_read_address_request(void);
static void ble_uart_response_application_extflash_config_train_plan_write_address_request(void);
static void ble_uart_response_application_extflash_config_train_plan_result_request_uuid(void);
static void ble_uart_response_application_extflash_config_train_plan_result_read_address_request(void);
static void ble_uart_response_application_extflash_config_train_plan_result_write_address_request(void);
static void ble_uart_response_application_extflash_config_train_plan_notify_switch(void);
static void ble_uart_response_application_extflash_config_train_plan_erase_address_request(void);			
static void ble_uart_response_application_extflash_config_train_plan_result_erase_address_request(void);	
static void ble_uart_response_application_get_watch_calculate_param_write(void);
static void ble_uart_response_application_get_watch_calculate_param_read(void);

