xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
static void ble_uart_responese_application_sensor_data_upload(void);
static void ble_uart_application_sensor_data_upload_transfer(void);

static void ble_uart_response_app_ble_dfu_start(void);
static void ble_uart_response_app_ble_dfu_finish(void);
static void ble_uart_response_app_ble_dfu_apollo_bootsetting(void);
static void ble_uart_response_app_ble_dfu_apollo_prevalidate(void);
static void ble_uart_response_app_ble_dfu_apollo_postvalidate(void);
static void ble_uart_response_app_ble_dfu_apollo_reset_n_activate(void);
static void ble_uart_command_application_notify_msg_action_perform(void);

static void ble_uart_response_application_watch_face_info(void);
static void ble_uart_response_application_watch_face_info_2(void);
static void ble_uart_response_application_watch_face_finish(void);
static void ble_uart_response_application_watch_face_activate(void);



#ifdef SOS_ADVERTISING 
static void ble_uart_command_application_sos_gps(void);					
#endif	
static void ble_uart_response_application_find_watch(void);
static void ble_uart_response_application_get_watch_default_sport_mode(void);
static void ble_uart_response_application_send_gps_test_data(void);


#ifdef WATCH_HAS_HYTERA_FUNC
static void ble_uart_response_application_hytera_hr_collcte_start(void);
static void ble_uart_response_application_hytera_hr_collcte_stop(void);
static void ble_uart_response_application_hytera_sport_data_collcte_start(void);
static void ble_uart_response_application_hytera_sport_data_collcte_stop(void);
static void ble_uart_response_application_hytera_sport_data_read(void);
static void ble_uart_response_application_hytera_hr_data_read(void);

#endif


task_apollo2_ht_rssi_callback g_ht_rssi_callback = NULL;
extern ble_config_params_t     *g_ble_config;
#ifdef COD  
extern uint16_t cod_usr_ble_tx_mtu;
#endif


typedef struct __attribute__((packed))
{
	uint32_t command;
	union __attribute__((packed))
	{
		int32_t rssi;
		struct __attribute__((packed))
		{
			uint32_t interval;            /**< Scan interval between 0x0004 and 0x4000 in 0.625 ms units (2.5 ms to 10.24 s). */
			uint32_t window;              /**< Scan window between 0x0004 and 0x4000 in 0.625 ms units (2.5 ms to 10.24 s). */
			uint32_t timeout;             /**< Scan timeout between 0x0001 and 0xFFFF in seconds, 0x0000 disables timeout. */
			uint32_t uuid;			
		}_param;
		
	}_U;
}_hardware_test_ble_rssi;

_hardware_test_ble_rssi m_hardware_test_ble_rssi;





static void task_cb(uint32_t evt, uint8_t *p_data, uint32_t length)
{
	NRF_LOG_DEBUG("task_cb");
	
	//uart_task_cb++;
	
	#ifdef TASK_APOLLO_USE_QUEUE
	_queue_task  queue = {0};
	queue.evt = evt;
	queue.p_data = (uint32_t *)p_data;
	queue.length = length;
	

	BaseType_t yield_req = pdFALSE;
	xQueueSendFromISR( QueueTask, &queue, &yield_req );

	/* Switch the task if required. */
	portYIELD_FROM_ISR(yield_req);

	#else 
	m_task_buffer.evt = evt;
	m_task_buffer.p_data = (uint32_t *)p_data;
	m_task_buffer.length = length;
	BaseType_t yield_req = pdFALSE;
	vTaskNotifyGiveFromISR(task_handle, &yield_req);

	
	/* Switch the task if required. */
	portYIELD_FROM_ISR(yield_req);
     #endif
	

	
}
extern bool g_app_error_reset_flag;
extern bool g_ble_dfu_finish_flag;
extern bool g_app_other_reset_flag;


static void PC_UART_CCOMMAND_MASK_APPLICATION_POSITION_FUNC(void)
{

							#ifdef TASK_APOLLO_USE_QUEUE
							switch(queue.p_data[0]&0x0000FF00)
							#else
							switch(m_task_buffer.p_data[0]&0x0000FF00)
							#endif 
							{
								case BLE_UART_CCOMMAND_APPLICATION_JUMP_BOOTLOADER:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_JUMP_BOOTLOADER");
									ble_uart_ccommand_applciation_jump_bootloader();
								}break;
								
								
								case BLE_UART_CCOMMAND_APPLICATION_BLE_INFO:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_BLE_INFO");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_ccommand_application_ble_info();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_INFO_APOLLO2:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_INFO_APOLLO2");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_info_apollo2();
								}break;
								#ifdef COD
								case BLE_UART_RESPONSE_APPLICATION_INFO_BAT:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_INFO_BAT");
									ble_uart_response_application_info_bat();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_READ");
									ble_uart_response_application_current_time_read();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_LOCATION_INFO:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_LOCATION_INFO");
									ble_uart_response_application_location_info();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_STATUS:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_STATUS");
									ble_uart_response_application_phone_call_status();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_DELAY:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_DELAY");
									ble_uart_response_application_phone_call_delay();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_CTRL:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_PHONE_CALL_CTRL");
									ble_uart_response_application_phone_call_ctrl();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_ON_BIND_DEVICE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_ON_BIND_DEVICE");
									ble_uart_response_application_on_bind_device();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_SEND_BIND_STATUS:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SEND_BIND_STATUS");
									ble_uart_response_application_send_bind_status();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_CMD_CAST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_CMD_CAST");
									ble_uart_response_application_cmd_cast();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_RT_TODAY:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_RT_TODAY");
									ble_uart_response_application_rt_today();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_RT_HEART:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_RT_HEART");
									ble_uart_response_application_rt_heart();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_SPORT_CTRL:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SPORT_CTRL");
									ble_uart_response_application_sport_ctrl();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_TRAINS:{
									//NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_TRAINS");
									ble_uart_response_application_sensor_data_trains();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_REST_HEARTRATE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_ON_BIND_DEVICE");
									ble_uart_response_application_rest_heartrate();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_DATA_FRAME_NUM:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_DATA_FRAME_NUM");
									ble_uart_response_application_data_frame_num();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_DELETE_DATA:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_DELETE_DATA");
									ble_uart_response_application_deletle_data();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_MAC_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_MAC_READ");
									ble_uart_response_application_mac_read();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_MAC_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_MAC_READ");
									ble_uart_response_application_mac_write();
									}break;
							    case BLE_UART_RESPONSE_APPLICATION_UPDATA_BP_START:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_UPDATA_BP_START");
									ble_uart_response_application_updata_bp_start();
									}break;
								case BLE_UART_RESPONSE_APPLICATION_REAL_TIME_LOG_TRAINS:{
									//NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_TRAINS");
									ble_uart_response_application_real_time_log_trains();
									}break;
								#endif
								#ifdef WATCH_QIWEI_SPORT_DATA
								case BLE_UART_RESPONSE_APPLICATION_SPORT_DATA_UPLOAD:{
									//NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SPORT_DATA_UPLOAD");
									ble_uart_response_application_sport_data_upload();
									}break;
								#endif
								case PC_UART_RESPONSE_APPLICATION_JUMP_BOOTLOADER:{
									NRF_LOG_INFO("PC_UART_RESPONSE_APPLICATION_JUMP_BOOTLOADER");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									pc_uart_response_application_jump_bootloader();
								}break;						
			
								case BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_CURRENT_TIME_WRITE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_current_time_write();
								}break;									
								case BLE_UART_RESPONSE_APPLICATION_WEATHER_INFO_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WEATHER_INFO_REQUEST");
									//NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_weather_info_request();
								}break;									
								case BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_READ");
									//NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_personal_info_read();
								}break;		
								case BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_PERSONAL_INFO_WRITE");
									//NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_personal_info_write();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_READ");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_sports_param_read();
								}break;		
								case BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SPORTS_PARAM_WRITE");
									//NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_sports_param_write();
								}break;			
								case BLE_UART_RESPONSE_APPLICATION_APP_MESSAGE_ANDROID:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_APP_MESSAGE_ANDROID");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_app_message_android();
								}break;	
								case BLE_UART_RESPONSE_APPLICATION_WECHAT_SPORT_DATA_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WECHAT_SPORT_DATA_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_wechat_sport_data_request();
								}break;		
								case BLE_UART_CCOMMAND_APPLICATION_SCAN_ENABLE:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_SCAN_ENABLE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_cdommand_application_scan_enable();
								}break;	
								case BLE_UART_CCOMMAND_APPLICATION_SCAN_DISABLE:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_SCAN_DISABLE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_cdommand_application_scan_disable();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ASTRO_SYNC_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ASTRO_SYNC_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_astro_sync_request();
								}break;					
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_MAIN_DAY_DATA_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_MAIN_DAY_DATA_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_main_day_data_request();
								}break;		
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_activity_address_request();
								}break;		
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_BOUNDARY_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_ACTIVITY_ADDRESS_BOUNDARY_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_activity_address_boundary_request();
								}break;									
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_shard_track_address_request();
								}break;			
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_HEADER_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_SHARD_TRACK_HEADER_WRITE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_shard_track_header_write();
								}break;								
								case BLE_UART_CCOMMAND_APPLICATION_FIND_PHONE:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_FIND_PHONE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_command_application_find_phone();
								}break;										
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_REQUEST_UUID:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_REQUEST_UUID");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_request_uuid();
								}break;									
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_READ_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_READ_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_read_address_request();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_WRITE_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_WRITE_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_write_address_request();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_REQUEST_UUID:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_REQUEST_UUID");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_result_request_uuid();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_READ_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_READ_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_result_read_address_request();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_WRITE_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_WRITE_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_result_write_address_request();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_NOTIFY_SWITCH:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_NOTIFY_SWITCH");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_notify_switch();
								}break;												
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_ERASE_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_ERASE_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_erase_address_request();
								}break;				
								case BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_ERASE_ADDRESS_REQUEST:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_EXTFLASH_CONFIG_TRAIN_PLAN_RESULT_ERASE_ADDRESS_REQUEST");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_extflash_config_train_plan_result_erase_address_request();
								}break;												

