xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
								case BLE_UART_RESPONSE_APPLICATION_GET_WATCH_CALCULATE_PARAM_WRITE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_GET_WATCH_CALCULATE_PARAM_WRITE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_get_watch_calculate_param_write();
								}break;	
								case BLE_UART_RESPONSE_APPLICATION_GET_WATCH_CALCULATE_PARAM_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_GET_WATCH_CALCULATE_PARAM_READ");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_get_watch_calculate_param_read();
								}break;	
								case BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_INFO:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_INFO");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_watch_face_info();
								}break;		
								case BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_INFO_2:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_INFO_2");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_watch_face_info_2();
								}break;								
								case BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_FINISH:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_FINISH");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_watch_face_finish();
								}break;	
								case BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_ACTIVATE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_WATCH_FACE_ACTIVATE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_watch_face_activate();
								}break;									
								
								
								case BLE_UART_CCOMMAND_APPLICATION_NOTIFY_MSG_ACTION_PERFORM:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_NOTIFY_MSG_ACTION_PERFORM");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_command_application_notify_msg_action_perform();
								}break;	
								
								
#ifdef SOS_ADVERTISING 
								case BLE_UART_CCOMMAND_APPLICATION_SOS_GPS:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_SOS_GPS");
									ble_uart_command_application_sos_gps();
								}break;							
#endif								


								case BLE_UART_RESPONSE_APPLICATION_FIND_WATCH:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_FIND_WATCH");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_find_watch();
								}break;

								case BLE_UART_RESPONSE_APPLICATION_GET_WATCH_DEFAULT_SPORT_MODE:{
								    NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_GET_WATCH_DEFAULT_SPORT_MODE");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_get_watch_default_sport_mode();
								}break;
								
								case BLE_UART_CCOMMAND_APPLICATION_SEND_GPS_TEST_DATA:{
								    NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_SEND_GPS_TEST_DATA");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_send_gps_test_data();
								}break;

								case BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_UPLOAD:{
								    NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_SENSOR_DATA_UPLOAD");
									NRF_LOG_HEXDUMP_INFO(queue.p_data, 11);
									ble_uart_responese_application_sensor_data_upload();
								}break;
								case BLE_UART_APPLICATION_SENSOR_DATA_UPLOAD_TRANSFER:{
								    NRF_LOG_INFO("BLE_UART_APPLICATION_SENSOR_DATA_UPLOAD_TRANSFER");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_application_sensor_data_upload_transfer();
								}break;
							#if defined (WATCH_HAS_HYTERA_FUNC)
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_HEARTRATE_COLLECTION_START:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_HYTERA_HEARTRATE_COLLECTION_START");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_hr_collcte_start();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_HEARTRATE_COLLECTION_STOP:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_HYTERA_HEARTRATE_COLLECTION_STOP");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_hr_collcte_stop();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_START:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_START");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_sport_data_collcte_start();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_STOP:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_COLLECTION_STOP");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_sport_data_collcte_stop();
								}break;
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_SPORT_DATA_READ:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_HYTERA_SPORT_DATA_READ");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_sport_data_read();					
								}break;
								case BLE_UART_RESPONSE_APPLICATION_HYTERA_HEARTRATE_DATA_READ:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APPLICATION_HYTERA_HEARTRATE_DATA_READ");
									NRF_LOG_HEXDUMP_INFO(g_ble_config->dev_name.name, 11);
									ble_uart_response_application_hytera_hr_data_read();					
								}break;
								
							#endif
								default:{
									NRF_LOG_INFO("UNSPPORTED COMMAND");
									drv_apollo2_uart_close();	
								}break;
							}				

}
static void task(void * pvParameter)
{
    NRF_LOG_DEBUG("task");
	(void)pvParameter;	
	
	if(g_app_error_reset_flag || g_app_other_reset_flag)
	{
		NRF_LOG_INFO("g_app_error_reset_flag");
		uint32_t command = BLE_UART_CCOMMAND_APPLICATION_RESET | BLE_UART_CCOMMAND_MASK_APPLICATION;	
		_uart_data_param param;
		param.user_callback = NULL;
		param.p_data = (uint8_t *)&command;
		param.length = sizeof(command);
		uint8_t count = TASK_UART_DELAY_COUNT_OUT;
		while(drv_ble_send_data(&param) != NRF_SUCCESS && count--)
		{
			DELAY_MS(TASK_UART_DELAY);
		}		
	
