xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
	}

	if(g_ble_dfu_finish_flag)
	{
		NRF_LOG_INFO("g_ble_dfu_finish_flag");
		uint32_t command = BLE_UART_CCOMMAND_APP_BLE_DFU_APOLLO_RESET_N_ACTIVATE | BLE_UART_CCOMMAND_MASK_APP;	
		_uart_data_param param;
		param.user_callback = NULL;
		param.p_data = (uint8_t *)&command;
		param.length = sizeof(command);
		uint8_t count = TASK_UART_DELAY_COUNT_OUT;
		while(drv_ble_send_data(&param) != NRF_SUCCESS && count--)
		{
			DELAY_MS(TASK_UART_DELAY);
		}	
	}
	
	
		while (1)
		{

			#ifdef TASK_APOLLO_USE_QUEUE	
			if (xQueueReceive(QueueTask, &queue, portMAX_DELAY) == pdTRUE)
			{
			
			 // NRF_LOG_ERROR("queue %x\r\n",queue.p_data);
			  switch(queue.evt)
			 
			#else

			(void) ulTaskNotifyTake(pdTRUE,/* Clear the notification value before exiting (equivalent to the binary semaphore). */
                                portMAX_DELAY); /* Block indefinitely (INCLUDE_vTaskSuspend has to be enabled).*/

				
		
				switch(m_task_buffer.evt)
				#endif
	
					

				{
					case APP_UART_TIMEOUT:
						NRF_LOG_DEBUG("APP_UART_TIMEOUT");
					case APP_UART_DATA_READY:{
						//NRF_LOG_DEBUG("APP_UART_DATA_READY");
						//NRF_LOG_HEXDUMP_INFO(m_task_buffer.p_data, 8);
						#ifdef TASK_APOLLO_USE_QUEUE
						if(queue.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_APPLICATION_POSITION)<<8))
						#else
						if(m_task_buffer.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_APPLICATION_POSITION)<<8))
						#endif
						{
							//NRF_LOG_DEBUG("PC_UART_CCOMMAND_MASK_APPLICATION_POSITION");
							PC_UART_CCOMMAND_MASK_APPLICATION_POSITION_FUNC();
						}
						#ifdef TASK_APOLLO_USE_QUEUE
						else if(queue.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_BOOTLOADER_POSITION)<<8))
						{
							switch(queue.p_data[0]&0x0000FF00)
						#else
						else if(m_task_buffer.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_BOOTLOADER_POSITION)<<8))
						{
							switch(m_task_buffer.p_data[0]&0x0000FF00)
					    #endif
							{
								case BLE_UART_CCOMMAND_APPLICATION_JUMP_BOOTLOADER:{
									NRF_LOG_INFO("BLE_UART_CCOMMAND_APPLICATION_JUMP_BOOTLOADER");
									ble_uart_ccommand_applciation_jump_bootloader();
								}break;	


							
								default:{
									NRF_LOG_INFO("UNSPPORTED COMMAND");
									drv_apollo2_uart_close();
								}break;
							}							
					
						}
						#ifdef TASK_APOLLO_USE_QUEUE
						else if(queue.p_data[0] & ((1<<BLE_UART_CCOMMAND_MASK_APP_POSITION)<<8))
						{
							switch(queue.p_data[0]&0x0000FF00)
						#else
						else if(m_task_buffer.p_data[0] & ((1<<BLE_UART_CCOMMAND_MASK_APP_POSITION)<<8))
						{
							switch(m_task_buffer.p_data[0]&0x0000FF00)
						#endif
							{
								case BLE_UART_RESPONSE_APP_BLE_DFU_START:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_START");
									ble_uart_response_app_ble_dfu_start();
								}break;
								case BLE_UART_RESPONSE_APP_BLE_DFU_FINISH:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_FINISH");
									ble_uart_response_app_ble_dfu_finish();
								}break;
								case BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_BOOTSETTING:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_BOOTSETTING");
									ble_uart_response_app_ble_dfu_apollo_bootsetting();
								}break;
								case BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_PREVALIDATE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_PREVALIDATE");
									ble_uart_response_app_ble_dfu_apollo_prevalidate();
								}break;								
								case BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_POSTVALIDATE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_POSTVALIDATE");
									ble_uart_response_app_ble_dfu_apollo_postvalidate();
								}break;										
								case BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_RESET_N_ACTIVATE:{
									NRF_LOG_INFO("BLE_UART_RESPONSE_APP_BLE_DFU_APOLLO_RESET_N_ACTIVATE");
									ble_uart_response_app_ble_dfu_apollo_reset_n_activate();
								}break;


								
								default:{
									NRF_LOG_INFO("UNSPPORTED COMMAND");
									drv_apollo2_uart_close();
								}break;
							}								
							
						}			
						
						#ifdef TASK_APOLLO_USE_QUEUE
						else if(queue.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_HARDWARE_TEST_POSITION)<<8))
						{
							switch(queue.p_data[0]&0x0000FF00)
						#else
						else if(m_task_buffer.p_data[0] & ((1<<PC_UART_CCOMMAND_MASK_HARDWARE_TEST_POSITION)<<8))
						{
							switch(m_task_buffer.p_data[0]&0x0000FF00)
						#endif
							{
								case PC_UART_COMMAND_HARDWARE_TEST_BLE_INFO_READ:{
									NRF_LOG_INFO("PC_UART_COMMAND_HARDWARE_TEST_BLE_INFO_READ");
									pc_uart_command_hardware_test_ble_info_read();
								}break;			
								case PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ:{
									NRF_LOG_INFO("PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ");
									pc_uart_command_hardware_test_ble_rssi_read();
								}break;	
								case PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ_STOP:{
									NRF_LOG_INFO("PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ_STOP");
									pc_uart_command_hardware_test_ble_rssi_read_stop();
								}break;	
								case PC_UART_COMMAND_HARDWARE_TEST_BLE_EXTFLASH_READ:{
									NRF_LOG_INFO("PC_UART_COMMAND_HARDWARE_TEST_BLE_EXTFLASH_READ");
									pc_uart_command_hardware_test_ble_extflash_read();
								}break;

							
								default:{
									NRF_LOG_INFO("UNSPPORTED COMMAND");
									drv_apollo2_uart_close();
								}break;
							}								
							
						}
						else{
							NRF_LOG_INFO("UNSPPORTED MASK");
							drv_apollo2_uart_close();
						}			
						
				


					}break;	
	
					case APP_UART_TX_EMPTY:{
						NRF_LOG_DEBUG("APP_UART_TX_EMPTY");
					}break;
					case APP_UART_COMMUNICATION_ERROR:{
						NRF_LOG_DEBUG("APP_UART_COMMUNICATION_ERROR");
					}break;
					case APP_UART_FIFO_ERROR:{
						NRF_LOG_DEBUG("APP_UART_FIFO_ERROR");
					}break;		
	
					
					case APP_UART_CTS_INTERRUPT:{
						NRF_LOG_DEBUG("APP_UART_CTS_INTERRUPT");
//						nrf_delay_us(5);
						if (nrf_drv_gpiote_in_is_set(APOLLO2_CTS_PIN_NUMBER))
						{
							drv_apollo2_on_cts_high();
						}
						else
						{
							drv_apollo2_on_cts_low();
							if(m_ble_jump_bootloader)
							{
//								if(xTaskGetSchedulerState() == taskSCHEDULER_RUNNING)
//								{
//									taskENTER_CRITICAL();
//								}
//								uint32_t err_code;
//								uint8_t softdevice_enabled;
//								err_code = sd_softdevice_is_enabled(&softdevice_enabled);
//								APP_ERROR_CHECK(err_code);
//								if(softdevice_enabled)
//								{
//									err_code = sd_softdevice_disable();
//									APP_ERROR_CHECK(err_code);	
//								}			
//								nrf_power_gpregret_set(CMD_GPREGRET_BOOTLOADER_PC_DFU);								
//								NVIC_SystemReset();
								
									
									uint32_t err_code;
									err_code = drv_ble_flash_delete();
									APP_ERROR_CHECK(err_code);
									err_code = sd_power_gpregret_clr(0, 0xffffffff);
									APP_ERROR_CHECK(err_code);
									err_code = sd_power_gpregret_set(0, CMD_GPREGRET_BOOTLOADER_PC_DFU);
									APP_ERROR_CHECK(err_code);		
									drv_wdt_feed();
									nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_DFU);						
							}							
						}							
					}break;						
					default:{
						
					}break;
				}
#ifdef TASK_APOLLO_USE_QUEUE
			}
#endif
			
