xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
    }
}


void task_apollo2_init(void * p_context)
{
  NRF_LOG_DEBUG("task_apollo2_init");

	

	drv_apollo2_init(task_cb);
		
	
	

	BaseType_t xReturned = xTaskCreate(task,
																		 "APOL",
																		 256+64,
																		 p_context,
																		 _PRIO_APP_HIGH,
																		 &task_handle);
	if (xReturned != pdPASS)
	{
			NRF_LOG_ERROR("task not created.");
			APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
	}

    #ifdef TASK_APOLLO_USE_QUEUE
	QueueTask = xQueueCreate( 5,sizeof( _queue_task ));
	#endif

	

}


static void	ble_uart_ccommand_application_ble_info(void)
{
	_dev_apollo2_ble_info ble_info;
	dev_apollo2_ble_info_get(&ble_info);
	drv_apollo2_uart_put((uint8_t *)&ble_info, sizeof(_dev_apollo2_ble_info));
}	

_info_apollo2 g_info_apollo2;
static void ble_uart_response_application_info_apollo2(void)									
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	memcpy((uint8_t *)&g_info_apollo2,buffer,sizeof(_info_apollo2));
	#if defined (COD)
	NRF_LOG_INFO("g_info_apollo2.pcb_version --> %x,%x",(uint8_t)(g_info_apollo2.pcb_version >>8),(uint8_t)g_info_apollo2.pcb_version);
	NRF_LOG_INFO("g_info_apollo2.application_version --> %x,%X",(uint8_t)(g_info_apollo2.application_version>>8),(uint8_t)g_info_apollo2.application_version);
	cod_cmd_device_version_resp((uint8_t)(g_info_apollo2.pcb_version >>8),(uint8_t)g_info_apollo2.pcb_version,
				(uint8_t)(g_info_apollo2.application_version>>8),(uint8_t)g_info_apollo2.application_version);
	#else
	NRF_LOG_INFO("g_info_apollo2.bootloader_version --> 0x%08X",g_info_apollo2.bootloader_version);	
	NRF_LOG_INFO("g_info_apollo2.application_version --> 0x%08X",g_info_apollo2.application_version);
	NRF_LOG_INFO("g_info_apollo2.update_version --> 0x%08X",g_info_apollo2.update_version);
	NRF_LOG_INFO("g_info_apollo2.pcb_version --> 0x%08X",g_info_apollo2.pcb_version);
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
	#endif
}
#ifdef COD
extern uint8_t g_battery_level;
static void ble_uart_response_application_info_bat(void)									
{
	uint32_t command[2];
	cod_battery_status ele_status;
	uint8_t ele;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	ele = (uint8_t)(command[1] >>8);
	ele_status = (cod_battery_status)(command[1]&0xFF);
	NRF_LOG_INFO("%s-->%d,%d\r\n",__func__,ele,ele_status);	
	cod_cmd_device_ele_resp(ele, ele_status);
	g_battery_level = ele;

}

static void ble_uart_response_application_current_time_read(void)									
{
	_ble_current_time ble_app_time;
	cod_ble_time time;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&ble_app_time,(uint8_t *)queue.p_data, sizeof(ble_app_time));
	#else
	memcpy((uint8_t *)&ble_app_time,(uint8_t *)m_task_buffer.p_data, sizeof(ble_app_time));
	#endif
	drv_apollo2_uart_close();

	time.year = ble_app_time.year +2000;
	time.month = ble_app_time.month;
	time.day = ble_app_time.date;          
	time.hour = ble_app_time.hour;         
	time.minute = ble_app_time.minute;         
	time.second = ble_app_time.second; 
	if (ble_app_time.day_of_week == 0){//星期格式转换
		time.week = 6;
	}
	else{
		time.week = ble_app_time.day_of_week -1;
	}
   	time.time_format = 0;   
   	time.time_zone = ble_app_time.time_zone;
	NRF_LOG_INFO("%s-->%d,%d,%d,\r\n",__func__,time.year,time.month,time.day);	
	NRF_LOG_INFO("time %d,%d,%d,%d\r\n",time.hour,time.minute,time.second,time.week);

	cod_cmd_get_time_resp(&time);

}

static void ble_uart_response_application_location_info(void)									
{
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);	
	cod_cmd_set_location_info_resp();

}

static void ble_uart_response_application_phone_call_status(void)									
{
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);	
	cod_cmd_sync_phone_call_status_resp();

}

static void ble_uart_response_application_phone_call_delay(void)									
{
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);	
	cod_cmd_set_phone_call_virb_delay_resp();

}

static void ble_uart_response_application_phone_call_ctrl(void)									
{
	uint32_t command[2];
	cod_ble_phone_call_ctrl ctrl;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	ctrl = (cod_ble_phone_call_ctrl)(command[1]);
	NRF_LOG_INFO("%s-->%d\r\n",__func__,ctrl);	
	cod_cmd_phone_call_ctrl_req(ctrl);

}

static void ble_uart_response_application_on_bind_device(void)									
{
	uint32_t command[2];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	bool is_success = (bool)(command[1]);
	NRF_LOG_INFO("%s-->%d\r\n",__func__,is_success);	
	cod_cmd_bind_device_resp(is_success);

}
static void ble_uart_response_application_send_bind_status(void)									
{

	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s\r\n",__func__);	
	cod_cmd_send_bind_status_resp();

}

static void ble_uart_response_application_cmd_cast(void)									
{
	cod_ble_cast_result result;
	uint32_t command[2];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	result  = (cod_ble_cast_result)(command[1]);;
	NRF_LOG_INFO("%s: %d\r\n",__func__,result);	
	cod_cmd_cast_resp(result);

}

static void ble_uart_response_application_rt_today(void)									
{
	uint32_t command[4];
	float calorie;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	calorie =  command[3]/1000 + 0.1*(command[3]%1000/100) +0.01*(command[3]%100/10)+0.001 *(command[3]%10);
	NRF_LOG_INFO("%s-->%d,%d,%d\r\n",__func__,command[1],command[2],command[3]);//卡路里传输卡,需转换	
	cod_cmd_rt_today_summary_data_resp(command[1],command[2],calorie);

