xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
}
static void ble_uart_response_application_rt_heart(void)									
{
	uint32_t command[2];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	uint8_t heart = (command[1]);
	NRF_LOG_INFO("%s-->%d\r\n",__func__,heart);	
	cod_cmd_rt_heart_bp_bo_resp(heart,0,0,0);

}

static void ble_uart_response_application_sport_ctrl(void)									
{
	uint32_t command[2];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	cod_ble_sport_ctrl ctrl = (cod_ble_sport_ctrl)(command[1]);
	NRF_LOG_INFO("%s-->%d\r\n",__func__,ctrl);	
	cod_cmd_sport_ctrl_req(ctrl);

}

static void ble_uart_response_application_sensor_data_trains(void)									
{
	uint8_t data[256];
	uint16_t len;
	uint32_t command;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&command,(uint8_t *)queue.p_data, sizeof(command));
	len = command >> 24 ;
	if (len > 252)
	{
		len = 252;
	}
	memcpy((uint8_t *)data,(uint8_t *)(queue.p_data +1), len);
	#else
	memcpy((uint8_t *)&command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	len = command >> 24 ;
	if (len > 252)
	{
		len = 252;
	}

	memcpy((uint8_t *)data,(uint8_t *)(m_task_buffer.p_data +1), len);
	#endif
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%d,%d",len,(data[0] >> 8|data[1]));	
	cod_cmd_sensor_data_trans_resp(data,len);

}


extern uint8_t cod_uart_normal_open;
static void ble_uart_response_application_real_time_log_trains(void)									
{
	uint8_t data[256];
	uint16_t len;
	uint32_t command;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&command,(uint8_t *)queue.p_data, sizeof(command));
	len = command >> 24 ;
	if (len > 252)
	{
		len = 252;
	}
	memcpy((uint8_t *)data,(uint8_t *)(queue.p_data +1), 252);
	#else
	memcpy((uint8_t *)&command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	len = command >> 24 ;
	if (len > 252)
	{
		len = 252;
	}
	memcpy((uint8_t *)data,(uint8_t *)(m_task_buffer.p_data +1), len);
	#endif
	drv_apollo2_uart_close();
	NRF_LOG_ERROR("hrt log %d,%d",len,(uint16_t)(data[250] << 8|data[251]));	
	cod_cmd_rt_heart_log_resp(data,len);

}

static void ble_uart_response_application_rest_heartrate(void)									
{
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s\r\n",__func__);	
	cod_cmd_set_rest_heart_rate_resp();


}

static void ble_uart_response_application_data_frame_num(void)									
{
	uint8_t data[256];
	uint16_t len;
	uint32_t num = 0;
	uint32_t temp;
	uint16_t frame_len = cod_usr_ble_tx_mtu-8; //减数据头8
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&temp,(uint8_t *)(queue.p_data +1), sizeof(temp));
	len = temp >> 16;
	memcpy((uint8_t *)data,(uint8_t *)(queue.p_data +2), len);
	#else
	memcpy((uint8_t *)&temp,(uint8_t *)(m_task_buffer.p_data +1), sizeof(temp));
	len = temp >> 16;
	memcpy((uint8_t *)data,(uint8_t *)(m_task_buffer.p_data +2), len);
	#endif
	drv_apollo2_uart_close();

	cod_ble_data_type type = (cod_ble_data_type)(temp&0xFFFF);
	//NRF_LOG_INFO("%s len %d,%d,%x\r\n",__func__,len,type,temp);	
	if( type==DATA_TYPE_STEP)
	{
		memcpy((uint8_t *)all_day_steps,(uint8_t *)data,sizeof(all_day_steps));
		memcpy((uint8_t *)all_day_sync_data,(uint8_t *)data +sizeof(all_day_steps),sizeof(all_day_sync_data));

		for (uint8_t i = 0;i < 7;i++)
		{
			NRF_LOG_INFO("size %d\r\n",all_day_steps[i].size);	
			if (all_day_steps[i].size != 0)
			{
				num += all_day_steps[i].size;
			}
		}
	   num += sizeof(all_day_sync_data);
	   NRF_LOG_WARNING("%s len %d",__func__,num);	
	   if ( (num %frame_len) == 0)
	   {
			num = num /frame_len;
	   }
	   else
	   {
			num = (num /frame_len) +1;
	   }
	
	}
	NRF_LOG_INFO("%s %d,%d\r\n",__func__,type,num);	
	cod_cmd_get_data_frame_num_resp(type,num,true);

}

static void ble_uart_response_application_deletle_data(void)									
{
	uint32_t command[2];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)command,(uint8_t *)queue.p_data, sizeof(command));
	#else
	memcpy((uint8_t *)command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	#endif
	drv_apollo2_uart_close();
	cod_ble_data_type type = (cod_ble_data_type)(command[1]);
	NRF_LOG_INFO("%s-->%d\r\n",__func__,type);	
	cod_cmd_delete_data_resp(type,true);

}

static void ble_uart_response_application_mac_read(void)									
{
	uint32_t	 err_code;
	ble_gap_addr_t device_addr;
	_ble_mac ble_mac;
	memset(&ble_mac,0,sizeof(_ble_mac));
	memset(&device_addr,0,sizeof(ble_gap_addr_t));
	err_code = sd_ble_gap_addr_get(&device_addr);

	for ( uint8_t i = 6; i >0;)
	{	
		i--;
		ble_mac.mac[5-i]= device_addr.addr[i];
	}
	NRF_LOG_INFO("[%s] err %d\r\n",__func__,err_code);
	NRF_LOG_INFO("read ble_mac %x:%x:%x:%x:%x:%x\r\n",ble_mac.mac[0],ble_mac.mac[1],ble_mac.mac[2],ble_mac.mac[3],ble_mac.mac[4],ble_mac.mac[5]);
	ble_mac.cmd = BLE_UART_CCOMMAND_APPLICATION_MAC_READ | BLE_UART_CCOMMAND_MASK_APPLICATION;
	drv_apollo2_uart_put((uint8_t *)&ble_mac, sizeof(_ble_mac));
	
}

static void ble_uart_response_application_mac_write(void)									
{
	_ble_mac ble_mac;
	
	uint32_t err_code;
	ble_gap_addr_t device_addr,device_read;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&ble_mac,(uint8_t *)queue.p_data, sizeof(_ble_mac));
	#else
	memcpy((uint8_t *)&ble_mac,(uint8_t *)m_task_buffer.p_data, sizeof(_ble_mac));
	#endif
	NRF_LOG_INFO("receive ble_mac %x:%x:%x:%x:%x:%x\r\n",ble_mac.mac[0],ble_mac.mac[1],ble_mac.mac[2],ble_mac.mac[3],ble_mac.mac[4],ble_mac.mac[5]);
	//ble_mac.mac[0] =0xCC;
	//sd_ble_gap_adv_stop()
	err_code = sd_ble_gap_addr_get(&device_addr);
	for ( uint8_t i = 6; i >0;)
	{	
		i--;
		device_addr.addr[5-i]= ble_mac.mac[i];
	}

	device_addr.addr_type = BLE_GAP_ADDR_TYPE_PUBLIC;
	NRF_LOG_INFO("device_addr %x:%x:%x:%x:%x:%x\r\n",device_addr.addr[0],device_addr.addr[1],device_addr.addr[2],device_addr.addr[3],device_addr.addr[4],device_addr.addr[5]); 
	err_code = drv_ble_flash_cod_mac_write(&device_addr);
	DELAY_MS(200);
	//sd_ble_gap_addr_set(&device_addr);
	NRF_LOG_INFO("[%s] %d,%d err %x\r\n",__func__,device_addr.addr_id_peer,device_addr.addr_type,err_code);

	//读出mac
	memset(&device_read,0,sizeof(ble_gap_addr_t));
	
	err_code = drv_ble_flash_cod_mac_read(&device_read);
	//sd_ble_gap_addr_get(&device_read);
	NRF_LOG_INFO("device_read %x:%x:%x:%x:%x:%x\r\n",device_read.addr[0],device_read.addr[1],device_read.addr[2],device_read.addr[3],device_read.addr[4],device_read.addr[5]);
	for ( uint8_t i = 6; i >0;)
	{	
		i--;
		ble_mac.mac[5-i]= device_read.addr[i];
	}

	ble_mac.cmd = BLE_UART_CCOMMAND_APPLICATION_MAC_WRITE | BLE_UART_CCOMMAND_MASK_APPLICATION;
	NRF_LOG_INFO("read ble_mac %x:%x:%x:%x:%x:%x\r\n",ble_mac.mac[0],ble_mac.mac[1],ble_mac.mac[2],ble_mac.mac[3],ble_mac.mac[4],ble_mac.mac[5]);
	drv_apollo2_uart_put((uint8_t *)&ble_mac, sizeof(_ble_mac));
	
