xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
}

static void ble_uart_response_application_updata_bp_start(void)									
{
	NRF_LOG_DEBUG("ble_uart_response_app_ble_dfu_start");
	drv_apollo2_uart_close();
	cod_cmd_ota_start_resp(cod_usr_ble_tx_mtu,10,200,FILE_TYPE_BP);;	
	
}


#endif

#ifdef WATCH_QIWEI_SPORT_DATA
static void ble_uart_response_application_sport_data_upload(void)									
{
	uint8_t data[47];
	uint16_t len;
	uint32_t command;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&command,(uint8_t *)queue.p_data, sizeof(command));
	
	memcpy((uint8_t *)data,(uint8_t *)(queue.p_data +1), 47);
	#else
	memcpy((uint8_t *)&command,(uint8_t *)m_task_buffer.p_data, sizeof(command));
	

	memcpy((uint8_t *)data,(uint8_t *)(m_task_buffer.p_data +1), 47);
	#endif
	drv_apollo2_uart_close();
	NRF_LOG_INFO("ble_uart_response_application_sport_data_upload %x:%x:%x\r\n",data[0],data[2],data[46]);	
	app_srv_apollo_flash_send(data, sizeof(data));

}
#endif
static void ble_uart_ccommand_applciation_jump_bootloader(void)									
{

	//	uint32_t command[1] = {BLE_UART_RESPONSE_APPLICATION_JUMP_BOOTLOADER | BLE_UART_CCOMMAND_MASK_APPLICATION};		
//	drv_apollo2_uart_put((uint8_t *)&command, sizeof(command));			
	drv_apollo2_uart_close();
	m_ble_jump_bootloader = true;//????????????λ??????????????bootloader

}
static void pc_uart_response_application_jump_bootloader(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
}	
static void pc_uart_command_hardware_test_ble_info_read(void)									
{
	_dev_apollo2_ble_info ble_info;
	dev_apollo2_ble_info_get(&ble_info);
	ble_info.command = PC_UART_COMMAND_HARDWARE_TEST_BLE_INFO_READ_RESPONSE | PC_UART_COMMAND_MASK_HARDWARE_TEST;
	drv_apollo2_uart_put((uint8_t *)&ble_info, sizeof(_dev_apollo2_ble_info));
	

}


static void scan_start(_hardware_test_ble_rssi *param)
{
	ret_code_t err_code;
	ble_gap_scan_params_t scan_params;
	scan_params.active = 1;
	scan_params.interval = param->_U._param.interval;
	scan_params.window = param->_U._param.window;
	scan_params.timeout = param->_U._param.timeout;
	scan_params.use_whitelist = 0;
	
	
	(void) sd_ble_gap_scan_stop();

	err_code = sd_ble_gap_scan_start(&scan_params);
	// It is okay to ignore this error since we are stopping the scan anyway.
	if (err_code != NRF_ERROR_INVALID_STATE)
	{
			APP_ERROR_CHECK(err_code);
	}
}


static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t  index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            p_typedata->p_data   = &p_data[index + 2];
            p_typedata->data_len = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}
static bool find_adv_uuid(const ble_gap_evt_adv_report_t *p_adv_report, const uint16_t uuid_to_find)
{
    ret_code_t err_code;
    data_t     adv_data;
    data_t     type_data;

    // Initialize advertisement report for parsing.
    adv_data.p_data     = (uint8_t *)p_adv_report->data;
    adv_data.data_len   = p_adv_report->dlen;

    err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                &adv_data,
                                &type_data);

    if (err_code != NRF_SUCCESS)
    {
        // Look for the services in 'complete' if it was not found in 'more available'.
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                    &adv_data,
                                    &type_data);

        if (err_code != NRF_SUCCESS)
        {
            // If we can't parse the data, then exit.
            return false;
        }
    }

    // Verify if any UUID match the given UUID.
    for (uint32_t u_index = 0; u_index < (type_data.data_len / sizeof(uint16_t)); u_index++)
    {
        uint16_t extracted_uuid;

        UUID16_EXTRACT(&extracted_uuid, &type_data.p_data[u_index * sizeof(uint16_t)]);

        if (extracted_uuid == uuid_to_find)
        {
            return true;
        }
    }
    return false;
}
static void ht_rssi_callback(ble_gap_evt_adv_report_t const* p_adv_report)
{
	ble_gap_addr_t p_addr 					= p_adv_report->peer_addr;
	int8_t rssi 										= p_adv_report->rssi;
	
	if (find_adv_uuid(p_adv_report, m_hardware_test_ble_rssi._U._param.uuid))
	{
		NRF_LOG_DEBUG("FOUND TARGET DEVICE");
		m_hardware_test_ble_rssi.command = PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ_RESPONSE | PC_UART_COMMAND_MASK_HARDWARE_TEST;
		m_hardware_test_ble_rssi._U.rssi = rssi;
		NRF_LOG_HEXDUMP_DEBUG(p_addr.addr, 6);		
		NRF_LOG_DEBUG("rssi --> %d dbm",m_hardware_test_ble_rssi._U.rssi );
		
		task_ble_conn_handle(TASK_BLE_CONN_HWT_RSSI_READ, (uint8_t *)&m_hardware_test_ble_rssi, 8);	
		
	}	
}


static void pc_uart_command_hardware_test_ble_rssi_read(void)									
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));	
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));	
	#endif
	drv_apollo2_uart_close();
	_hardware_test_ble_rssi *hardware_test_ble_rssi = (_hardware_test_ble_rssi *)buffer;
	
	NRF_LOG_DEBUG("interval --> 0x%04X",hardware_test_ble_rssi->_U._param.interval);
	NRF_LOG_DEBUG("window --> 0x%04X",hardware_test_ble_rssi->_U._param.window);
	NRF_LOG_DEBUG("timeout --> 0x%04X",hardware_test_ble_rssi->_U._param.timeout);
	NRF_LOG_DEBUG("uuid --> 0x%04X",hardware_test_ble_rssi->_U._param.uuid);
	
	g_ht_rssi_callback = ht_rssi_callback;
	
	memcpy(&m_hardware_test_ble_rssi,hardware_test_ble_rssi,sizeof(_hardware_test_ble_rssi));
	scan_start(&m_hardware_test_ble_rssi);
}


static void pc_uart_command_hardware_test_ble_rssi_read_stop(void)
{
	uint32_t command[1] = {PC_UART_COMMAND_HARDWARE_TEST_BLE_RSSI_READ_STOP_RESPONSE | PC_UART_COMMAND_MASK_HARDWARE_TEST};
	drv_apollo2_uart_put((uint8_t *)command, sizeof(command));									
	g_ht_rssi_callback = NULL;
	(void) sd_ble_gap_scan_stop();
	

	
