xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
}
static void pc_uart_command_hardware_test_ble_extflash_read(void)
{
	drv_apollo2_uart_close();
	uint8_t buffer[256];
	for(uint32_t i=0;i<sizeof(buffer);i++)
	{
		buffer[i] = i;
	}
	task_extFlash_handle(TASK_EXTFLASH_EVT_HWT, 0, buffer, sizeof(buffer));
}	
static void ble_uart_response_application_weather_info_request(void)
{
#ifdef COD 
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);
	cod_cmd_sync_weather_resp();
#else
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
#endif
}	

static void ble_uart_response_application_current_time_write(void)
{
#ifdef COD
	uint32_t response[2];
	bool success;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)response,(uint8_t *)queue.p_data, sizeof(response));
	#else
	memcpy((uint8_t *)response,(uint8_t *)m_task_buffer.p_data, sizeof(response));
	#endif
	drv_apollo2_uart_close();
	success = (bool)response[1];
	NRF_LOG_INFO("%s ,%d\r\n",__func__,success);	
	cod_cmd_set_time_resp(success);
	
#else
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
#endif
}

static void ble_uart_response_application_personal_info_read(void)
{
#ifdef COD 
	_ble_user_info cod_user_info;
	cod_ble_user_info userInfo;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&cod_user_info,(uint8_t *)queue.p_data, sizeof(cod_user_info));
	#else
	memcpy((uint8_t *)&cod_user_info,(uint8_t *)m_task_buffer.p_data, sizeof(cod_user_info))
	#endif
	drv_apollo2_uart_close();

	userInfo.gender = (cod_ble_gender)cod_user_info.gender;
	userInfo.age = cod_user_info.age;
	userInfo.height = cod_user_info.height;
	userInfo.weight = cod_user_info.weight;
	NRF_LOG_INFO("%s ,%d,%d,%d,%d\r\n",__func__,userInfo.gender,userInfo.age,userInfo.height,userInfo.weight);
	cod_cmd_get_user_info_resp(&userInfo);
#else
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
#endif
}	

static void ble_uart_response_application_personal_info_write(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	#ifdef COD 
	NRF_LOG_INFO("%s \r\n",__func__);
	cod_cmd_set_user_info_resp();
	#else
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
	#endif
}	
static void ble_uart_response_application_sports_param_read(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
}	
static void ble_uart_response_application_sports_param_write(void)
{
#ifdef COD
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);
	cod_cmd_set_step_target_resp();
#else
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
#endif
}	

static void ble_uart_response_application_app_message_android(void)
{
#ifdef COD 
	drv_apollo2_uart_close();
	NRF_LOG_INFO("%s \r\n",__func__);
	cod_cmd_notify_msg_resp();
#else
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
#endif
}	

static void ble_uart_response_application_wechat_sport_data_request(void)
{
	#ifndef COD 
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	
	_wechat_sport_data *wechat_sport_data = (_wechat_sport_data *)buffer;

	NRF_LOG_DEBUG("wechat_sport_data->step --> %d",wechat_sport_data->step);
	NRF_LOG_DEBUG("wechat_sport_data->calory --> %d",wechat_sport_data->calory);
	NRF_LOG_DEBUG("wechat_sport_data->distance --> %d",wechat_sport_data->distance);
	
	uint8_t pedo_data[10];
	pedo_data[0] = (1<<WECHAT_STEP | 1<<WECHAT_CALORY | 1<<WECHAT_DISTANCE);			
	pedo_data[1] = wechat_sport_data->step;
	pedo_data[2] = wechat_sport_data->step>>8;
	pedo_data[3] = wechat_sport_data->step>>16;		
	pedo_data[4] = wechat_sport_data->distance;
	pedo_data[5] = wechat_sport_data->distance>>8;
	pedo_data[6] = wechat_sport_data->distance>>16;		
	pedo_data[7] = wechat_sport_data->calory;
	pedo_data[8] = wechat_sport_data->calory>>8;
	pedo_data[9] = wechat_sport_data->calory>>16;		
	
	app_srv_wechat_pedo_meas_send(pedo_data,sizeof(pedo_data));		
#endif	
}

static void ble_uart_cdommand_application_scan_enable(void)
{
	drv_apollo2_uart_close();	
	task_ble_accessary_handle(TASK_BLE_ACCESSORY_EVT_SCAN_ENABLE, NULL, 0);	

}


static void ble_uart_cdommand_application_scan_disable(void)
{
	drv_apollo2_uart_close();	
	task_ble_accessary_handle(TASK_BLE_ACCESSORY_EVT_SCAN_DISABLE, NULL, 0);	

}

static void ble_uart_response_application_extflash_config_astro_sync_request(void)
{
#ifdef COD
	uint32_t command = 0;
	bool has_agps;
	uint16_t update_time;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)&command,(uint8_t *)&queue.p_data[1],sizeof(command));
	#else
	memcpy((uint8_t *)&command,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command));
	#endif
	drv_apollo2_uart_close();	
	has_agps = (bool)(command >> 16);
	update_time = (uint16_t)(command & 0xFFFF);
	NRF_LOG_INFO("%s %d,%d\r\n",__func__,has_agps,update_time);
	cod_cmd_agps_status_resp(has_agps,update_time);
#else
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_RRQUEST_ASTRO_SYNC_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);	
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();	
	app_srv_apollo_flash_send(command, sizeof(command));
#endif
}

