xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
static void ble_uart_response_application_extflash_config_main_day_data_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_MAIN_DAY_DATA_RRQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();	
	app_srv_apollo_flash_send(command, sizeof(command));	
}

static void ble_uart_response_application_extflash_config_activity_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_ACTIVITY_ADDRESS_RRQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();	
	app_srv_apollo_flash_send(command, sizeof(command));	
}

static void ble_uart_response_application_extflash_config_activity_address_boundary_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_ACTIVITY_ADDRESS_BOUNDARY_RRQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();	
	app_srv_apollo_flash_send(command, sizeof(command));		
}


static void ble_uart_response_application_extflash_config_shard_track_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_SHARED_TRACK_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));	
}
static void ble_uart_response_application_extflash_config_shard_track_header_write(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_SHARED_TRACK_HEADER_WRITE_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_command_application_find_phone(void)
{
	
	uint8_t command[20] = {CMD_NRF52_SRV_FIND_PHONE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_nrf52_control_send(command, sizeof(command));
}

static void ble_uart_response_application_extflash_config_train_plan_request_uuid(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_REQUEST_UUID_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_read_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_READ_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_write_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_WRITE_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_result_request_uuid(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_RESULT_REQUEST_UUID_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_result_read_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_RESULT_READ_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_result_write_address_request(void)
{
	
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_RESULT_WRITE_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_notify_switch(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_NOTIFY_SWITCH_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_extflash_config_train_plan_erase_address_request(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_ERASE_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}	
static void ble_uart_response_application_extflash_config_train_plan_result_erase_address_request(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_CONFIG_TRAIN_PLAN_RESULT_ERASE_ADDRESS_REQUEST_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}
static void ble_uart_response_application_get_watch_calculate_param_write(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
}
static void ble_uart_response_application_get_watch_calculate_param_read(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));
}

static void ble_uart_response_app_ble_dfu_start(void)
{
	#ifndef COD 
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_START_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
	#else
	NRF_LOG_DEBUG("ble_uart_response_app_ble_dfu_start");
	drv_apollo2_uart_close();

	cod_cmd_ota_start_resp(cod_usr_ble_tx_mtu,10,200,FILE_TYPE_OTA);
  #endif	
}

