xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/User/Task/APOLLO2/task_apollo2.c
static void ble_uart_response_app_ble_dfu_finish(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_DFU_FINISH_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));
}

static void ble_uart_response_app_ble_dfu_apollo_bootsetting(void)
{

}
static void ble_uart_response_app_ble_dfu_apollo_prevalidate(void)
{

}
static void ble_uart_response_app_ble_dfu_apollo_postvalidate(void)
{

}
static void ble_uart_response_app_ble_dfu_apollo_reset_n_activate(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_DFU_APOLLO_RESET_N_ACTIVATE_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	#ifndef COD 
	app_srv_apollo_flash_send(command, sizeof(command));
	#endif

}

static void ble_uart_command_application_notify_msg_action_perform(void)
{
	uint32_t buffer[64];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)buffer,(uint8_t *)queue.p_data, sizeof(buffer));
	#else
	memcpy((uint8_t *)buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));
	#endif
	drv_apollo2_uart_close();


	app_srv_ancs_msg_action_perform(buffer[1]);

	
	
}


static void ble_uart_response_application_watch_face_info(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_WATCH_FACE_INFO_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));	
}
static void ble_uart_response_application_watch_face_info_2(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_WATCH_FACE_INFO_2_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));	
}
static void ble_uart_response_application_watch_face_finish(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_WATCH_FACE_FINISH_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));	
}
static void ble_uart_response_application_watch_face_activate(void)
{
	uint8_t command[180] = {CMD_APOLLO_SRV_FLASH_DFU_BLE_WATCH_FACE_ACTIVATE_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_apollo_flash_send(command, sizeof(command));	
}
#ifdef SOS_ADVERTISING 
#include "ble_advertising.h"
#include "main.h"
extern uint16_t g_conn_handle_peripheral;
static void ble_uart_command_application_sos_gps(void)
{
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));	
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));	
	#endif
	drv_apollo2_uart_close();
	_sos_cmd *sos_cmd = (_sos_cmd *)buffer;
	if(sos_cmd->subcmd == SOS_SUBCMD_START)
	{
		NRF_LOG_INFO("SOS_SUBCMD_START");	
		ble_advertising_sos_gps_update((uint8_t *)&sos_cmd->msg, sizeof(sos_cmd->msg));
		if(g_conn_handle_peripheral != BLE_CONN_HANDLE_INVALID)
		{
			NRF_LOG_INFO("connected");	
			uint8_t response = CMD_NRF52_SRV_SOS_GPS;
			app_srv_nrf52_control_send(&response, sizeof(response));			
		}
	}
	else if(sos_cmd->subcmd == SOS_SUBCMD_FINISH)
	{
		NRF_LOG_INFO("SOS_SUBCMD_FINISH");
		ble_advertising_sos_gps_finish();
		
	}
	
}					
#endif	




static void ble_uart_response_application_find_watch(void)
{	
	uint8_t command[20] = {CMD_NRF52_SRV_FIND_WATCH_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif
	drv_apollo2_uart_close();
	app_srv_nrf52_control_send(command, sizeof(command));
}

static void ble_uart_response_application_get_watch_default_sport_mode(void)
{	
	uint8_t command[20] = {CMD_NRF52_SRV_GET_WATCH_DEFAULT_SPORT_MODE_RESPONSE};
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(command+1,(uint8_t *)&queue.p_data[1],sizeof(command)-1);
	#else
	memcpy(command+1,(uint8_t *)&m_task_buffer.p_data[1],sizeof(command)-1);
	#endif	
	drv_apollo2_uart_close();
	app_srv_nrf52_control_send(command, sizeof(command));
}

static void ble_uart_response_application_send_gps_test_data(void)
{	
	uint8_t buffer[256];
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy(buffer,(uint8_t *)queue.p_data, sizeof(buffer));	
	#else
	memcpy(buffer,(uint8_t *)m_task_buffer.p_data, sizeof(buffer));	
	#endif
	drv_apollo2_uart_close();
	NRF_LOG_DEBUG("ble_uart_response_application_send_gps_test_data");
	app_srv_apollo_uart_send((uint8_t *)buffer, sizeof(buffer));

	//uint32_t command[1] = {BLE_UART_RESPONSE_APPLICATION_SEND_GPS_TES_DATA | PC_UART_COMMAND_MASK_HARDWARE_TEST};	
	//drv_apollo2_uart_put((uint8_t *)command, sizeof(command));
}

static void ble_uart_responese_application_sensor_data_upload(void)
{

	
	uint8_t buffer[4]= {0};
	uint32_t resp[4];
	#ifdef TASK_APOLLO_USE_QUEUE
		memcpy(resp,(uint8_t *)&queue.p_data[1], sizeof(resp)); 
	#else
		memcpy(resp,(uint8_t *)&m_task_buffer.p_data[1], sizeof(resp)); 
	#endif
		buffer[0] = resp[0];
		buffer[1] = resp[1];
		buffer[2] = resp[2];
		buffer[3] = resp[3];
		NRF_LOG_INFO("ble_uart_responese_application_sensor_data_upload,%x,%x,%x",queue.p_data[0],queue.p_data[1],queue.p_data[2]);
		NRF_LOG_INFO("%x,%x-%x,%x",buffer[0],buffer[1],resp[0], resp[1]);
		drv_apollo2_uart_close();
		app_srv_apollo_sensor_send((uint8_t *)buffer, sizeof(buffer));
	
}


static void ble_uart_application_sensor_data_upload_transfer(void)
{

	
	uint8_t data[256];
	uint16_t len;
	uint32_t command;
	#ifdef TASK_APOLLO_USE_QUEUE
	memcpy((uint8_t *)data,(uint8_t *)&queue.p_data[1], 252);
	#else
	memcpy((uint8_t *)data,(uint8_t *)&m_task_buffer.p_data[1], 252);
	#endif
	drv_apollo2_uart_close();
	
	len = data[2] + 3;
	app_srv_apollo_sensor_send((uint8_t *)data, len);
	
}


